In [1]:
# Import modules
import pandas as pd
import sqlalchemy as sql

## Create the SQLite database and engine

In [2]:
# Create a temporary sqlite database
database_connection_string = 'sqlite:///'

In [3]:
# Database connection object
engine = sql.create_engine(database_connection_string)
engine

Engine(sqlite:///)

In [4]:
# Get table names from the database
engine.table_names()

[]

## Create a Table From a Pandas DataFrame

In [5]:
# Create the DataFrame
mortgage_dataframe = pd.DataFrame({'Amount': [100, 200], 'Rate': [0.375, 0.50]})

# Convert the DataFrame to a SQL table
mortgage_dataframe.to_sql('mortgage', engine, index=False, if_exists='replace')

# Confirm table creation
engine.table_names()

['mortgage']

## Read in a Database File

In [6]:
# Database filepath
database_connection_string = 'sqlite:///../Resources/mortgage.db'

In [7]:
# Database connection object
engine = sql.create_engine(database_connection_string)
engine

Engine(sqlite:///../Resources/mortgage.db)

In [8]:
# Get table names from the database
engine.table_names()

['customers', 'mortgages', 'payments']

# Review a table as a Pandas DataFrame

In [9]:
# Create the Pandas DataFrame from a database table
mortgage_customers_df = pd.read_sql_table('customers', con=engine)

# Review the DataFrame
mortgage_customers_df.head()

  customer_id first_name  last_name  age  zip_code  mortgage_id
0           0      David      Scott   74     31370       530180
1           1        Roy  Middleton   73     92023       625617
2           2    Shirley     Nelson   57     28670       588605
3           3        Rae     Bailey   29     74233       761909
4           4  Catherine    Carroll   50     90451       613158